import { Injectable } from '@angular/core';
import { Observable, of } from 'rxjs';
// import { Post } from '../../model/post.model';
import { Languages } from '../../enums/languages.enum';
import { VPostDetails } from '../../model/posts.interface';
import { HttpClient } from '@angular/common/http';

@Injectable({
  providedIn: 'root'
})
export class PostService {

//   recentPost: Post[] = [
//     {
//       postId: 293,
//       postTitle: "भगवान शिव (Lord Shiva) - महादेव के दिव्य रूपण",
//       postContent: `
     
//       भगवान शिव हिन्दू धर्म के महत्वपूर्ण देवता में से एक हैं। वे त्रिमूर्ति के भगवान हैं, जिनमें ब्रह्मा जी का सृजनकारण, विष्णु जी का पालन और महेश्वर (शिव) जी का संहार और सृष्टि का संचालन होता है।

//       <strong>रूपण और आभूषण:</strong> भगवान शिव का रूप विशाल और भयानक होता है। उनकी तिलक बिना जाते ही त्रिपुण्ड्र (तीन लाइनों की चिन्ह) होती है जो उनकी विशेष पहचान है। उनके शिरे पर सर्पों की माला और चंद्रमा की रटी बनी रहती है। उनके जटामुकुट से वीरेश्वर (वीरभद्र) जैसे सहायक भी उत्पन्न होते हैं।
      
//       <strong>नामकरण:</strong> भगवान शिव के कई नाम हैं जैसे भोलेनाथ, महादेव, नीलकंठ, रुद्र, ईश्वर, शंकर, नटराज आदि। ये सभी नाम उनके विभिन्न रूपों और आवतारों को दर्शाते हैं।
      
//       <strong>ध्यान और साधना:</strong> भगवान शिव की ध्यान और साधना से मन, शरीर और आत्मा की शुद्धि होती है। उनकी पूजा के लिए बिल्व पत्र, धातूरा, जल, धूप, दीप, अर्क, बिना जाते हुए दूध, गंध आदि का उपयोग होता है। भोलेनाथ की भक्ति से व्यक्ति को आत्मा की उन्नति और शांति प्राप्त होती है।
      
//       <strong>नटराज:</strong> भगवान शिव का एक प्रमुख रूप नटराज है, जिसमें वे नृत्य करते हुए दिखाए जाते हैं। नटराज के द्वारा उन्होंने सृष्टि की नीति-नियम का प्रतीक दिखाया है और इसे नष्ट होने और पुनर्निर्माण की स्थिति को दर्शाया है।
      
//       भगवान शिव ध्यान, साधना, और संयम के प्रतीक हैं जो व्यक्ति को आध्यात्मिक उन्नति की दिशा में मार्गदर्शन करते हैं। उनकी महिमा और शक्ति का वर्णन वेदों और पुराणों में होता है और उन्हें सभी दिशाओं में पूजा जाता है।`,
//       postDate: "09 February 2024",
//       postImageUrl: "/assets/images/shiva/shiva-1.jpg",
//       postUrl: "Post/293",
//       timeToRead: "5 Mins to Read",
//       postLanguage:Languages.Hindi
//     },
//     {
//       postId: 294,
//       postTitle: "दिव्य रहस्यों का पर्दाफाश: भगवान शिव के त्रिशूल, डमरू और रुद्राक्ष का प्रतीक",
//       postContent: `
//       **भगवान शिव के प्रतीकों का दिव्य रहस्य: त्रिशूल, डमरू और रुद्राक्ष**

//       भगवान शिव, हिंदू धर्म के प्रमुख देवताओं में से एक हैं, जिन्हें अक्सर उनके शक्तिशाली प्रतीकों के साथ प्रतिष्ठित किया जाता है। इन प्रतीकों के पीछे छिपे गहरे अर्थों को समझने से हम शिव की महानता और उनकी अद्वितीयता का अनुभव करते हैं। चलिए, हम इन प्रतीकों के रहस्य को समझें:
      
//       **1. त्रिशूल:**  
//       त्रिशूल, जिसमें तीन शूल होते हैं, शिव की विनाशक और परिवर्तनकारी शक्तियों का प्रतीक है। यह अहंकार, कामना, और माया के तीन गुणों को काटते हैं और हमें मोक्ष की ओर ले जाते हैं। त्रिशूल जिन्हें इच्छा, ज्ञान, और क्रिया की शक्तियों का प्रतिनिधित्व करता है। यह त्रिशूल शिव की शक्ति का प्रतीक है जो संसार के अध्यात्मिक और भौतिक उत्थान के लिए कार्यरत है।
      
//       **2. डमरू:**  
//       डमरू ध्वनि के प्रतीक है, जो सृष्टि की उत्पत्ति को दर्शाती है। इसकी ध्वनि ब्रह्मांड की उत्पत्ति और संहार की गति को प्रतिनिधित्व करती है। शिव के हाथ में डमरू सृजन और संहार की शक्ति का प्रतीक है, जो हमें आत्मज्ञान की ओर ले जाता है। डमरू की ध्वनि के द्वारा ही सृष्टि का नियमित चक्र चलता है, जिससे हमें सम्पूर्णता की अनुभूति होती है।
      
//       **3. रुद्राक्ष:**  
//       रुद्राक्ष, जो शिव के तीसरे नेत्र से उत्पन्न हुए हैं, आध्यात्मिक शक्ति का प्रतीक हैं। ये मोक्ष, शांति, और ज्ञान को प्रदान करते हैं और नकारात्मक ऊर्जा से बचाने और सकारात्मक ऊर्जा को आकर्षित करने में मदद करते हैं। रुद्राक्ष के माध्यम से हम शिव की कृपा को अनुभव करते हैं और उनके ध्यान में स्थित होते हैं।
      
//       **प्रतीकों का सम्मिलित अर्थ:**  
//       इन प्रतीकों को एक साथ देखकर, वे शिव की त्रिमूर्ति (ब्रह्मा, विष्णु, और महेश) का प्रतिनिधित्व करते हैं। त्रिशूल सृष्टि का विनाश, डमरू सृष्टि की उत्पत्ति, और रुद्राक्ष सृष्टि की पालन का प्रतीक है। ये हमें जीवन के चक्र को समझाते हैं और आध्यात्मिक विकास की ओर दिशा प्रदान करते हैं।
      
//       **अतिरिक्त विचार:**  
//       ये प्रतीक और उनके अर्थ कई कथाओं और विविध व्याख्याओं से भरे हैं, जो हमारे ज्ञान और आध्यात्मिक विकास में मदद करते हैं। इन प्रतीकों को देखना हमें शिव की कृपा और उनकी शक्ति का स्मरण कराता है, और सही रास्ते पर चलने की प्रेरणा प्रदान करता है।
      
//       **मुझे आशा है कि यह पोस्ट आपको भगवान शिव के प्रतीकों के गहरे अर्थों को समझने में मदद करेगी।**
//       `,
//       postDate: "10 February 2024",
//       postImageUrl: "/assets/images/post/post-294.jpg",
//       postUrl: "Post/294",
//       timeToRead: "6 Mins to Read",
//       postLanguage:Languages.Hindi
//     },
//     {
//       postId: 295,
//       postTitle: "भगवान शिव और माता पार्वती का दिव्य विवाह",
//       postContent: `
//       भगवान शिव और माता पार्वती के विवाह की कथा हिंदू धर्म में सबसे प्रमुख कथाओं में से एक है और इसका महत्व धर्मिक और सामाजिक संदेश के साथ-साथ भारतीय समाज में विवाह के पवित्रता की महत्वपूर्ण प्रतीकता है। 
//       यह कथा कई पुराणों में मिलती है, जिनमें शिव पुराण, ब्रह्मवैवर्त पुराण, देवी भागवत पुराण और स्कंद पुराण शामिल हैं। ब्रह्मवैवर्त पुराण में बताया गया है कि भगवान शिव और पार्वती का विवाह अत्यंत महत्त्वपूर्ण घटना है, 
//       इस कथा को गौर से समझने के लिए हमें प्राचीन धार्मिक परंपराओं, शास्त्रों, और कथाओं की विस्तृत जानकारी की आवश्यकता है।
      
//       पार्वती के जन्म के समय, देवताओं ने पूरे समुद्र के साथ हीमालय पर्वत को धारण किया था, जिसे हिमावान कहा जाता है। हिमावान और उनकी पत्नी मेना की एक अध्यात्मिक तपस्या के परिणामस्वरूप, उमा (पार्वती) उनकी कन्या रूप में जन्म लेती हैं।
//       वे बचपन से ही भगवान शिव की भक्त थीं और उन्हें अपने पति के रूप में प्राप्त करने की इच्छा रखती थीं।
//       इस भक्ति और प्रेम के साथ पार्वती ने भगवान शिव को प्रसन्न करने के लिए अनेक वर्षों तक कठोर तपस्या की।
        
//       पार्वती की तपस्या, उनका प्रेम और उनका समर्पण भगवान शिव को प्रसन्न करने के लिए काफी था। शिव, जो हमेशा ध्यानार्ध रहते हैं, ने भी पार्वती की अद्भुत प्रेम और तपस्या के सामर्थ्य को समझा। 
//       उन्होंने भी पार्वती की अत्यंत ध्यान से की गई तपस्या को स्वीकार किया और उनके प्रति अपनी प्रेम और समर्थन की भावना प्रकट की। इसके परिणामस्वरूप, शिव ने पार्वती के साथ विवाह के लिए सहमति दी।
      
//       भगवान शिव और पार्वती का विवाह एक दिव्य और उत्सवपूर्ण घटना था। यह विवाह ब्रह्मांड के समस्त देवताओं, ऋषियों, अन्य जीव-जंतु और भक्तों के साक्षात उपस्थिति में हुआ।
//       सारा ब्रह्मांड उत्सव और आनंद से भर गया, जब देवी पार्वती और भगवान शिव ने एक दूसरे के साथ विवाह किया।
      
//       भगवान शिव और माता पार्वती का विवाह को **"महाशिवरात्रि"** के दिन भी मनाया जाता है। यह दिन भगवान शिव के त्योहार के रूप में माना जाता है और इसे हिंदू कैलेंडर के **माघ महीने के कृष्ण पक्ष की चतुर्दशी** के दिन मनाया जाता है। 
//       इस दिन भक्त भगवान शिव के प्रति अपनी श्रद्धा और भक्ति को व्यक्त करते हैं और उनकी पूजा-अर्चना करते हैं। महाशिवरात्रि को भगवान शिव की विवाह अवसर के रूप में भी ध्यान में रखा जाता है।
      
//       यह कथा हमें सिखाती है कि यदि हम सच्चे मन से किसी चीज की इच्छा करते हैं तो वह हमें अवश्य प्राप्त होती है। विवाह संस्कार से जीवन में साझा किए जाने वाले समस्त संघर्षों, सुख-दुःखों, और आनंदों का एक अद्वितीय माध्यम है। 
//       प्रेम और समर्पण से बनी हुई संबंध ब्रह्मांड के सभी उपकरणों को संतुष्ट करते हैं और उन्हें सुख, शांति, और समृद्धि का आनंद प्रदान करते हैं। 
//       `,
//       postDate: "11 February 2024",
//       postImageUrl: "/assets/images/post/post-295.png",
//       postUrl: "Post/295",
//       timeToRead: "9 Mins to Read",
//       postLanguage:Languages.Hindi
//     },
//     {
//       postId: 296,
//       postTitle: "भगवान शिव को प्रसन्न करने के उपाय",
//       postContent: `      

// भगवान शिव को प्रसन्न करना सबसे आसान माना जाता है। वे भोलेनाथ के नाम से भी जाने जाते हैं, जो दर्शाता है कि वे सरल और दयालु हैं।

// यहां कुछ उपाय बताए गए हैं जो भगवान शिव को प्रसन्न करने में आपकी मदद कर सकते हैं:

// <br/>

// #### भक्ति और समर्पण:

// <br/>

//   - **शिव मन्त्रों का जाप: '[ॐ नमः शिवाय](https://omnamahshivay.in/#/CategoryList/Stuties/ShivMahimnaStotam/Sanskrit)'** या **'महा मृत्युंजय मंत्र'** का नियमित रूप से जाप भगवान शिव को प्रसन्न करने का एक सरल तरीका है।

//   - **शिव स्तुति:** **'[शिव स्तुति](https://omnamahshivay.in/#/CategoryList/Stuties)'**, जैसे कि शिव पंचाक्षर स्तोत्र या '[शिव चालीसा](https://omnamahshivay.in/#/CategoryList/ShivChalisa/ShivChalisa/Sanskrit)', का पाठ भी भगवान शिव को प्रसन्न करने में मददगार होता है।

//   - **शिव की पूजा:** **'[शिव की पूजा](https://omnamahshivay.in/#/CategoryList/ShivPooja/ShivManasPooja/Sanskrit)'** में जल अर्पण, बेल पत्र चढ़ाना, दीप जलाना, और धूप-दीप दिखाना शामिल है।

//   - **सच्चे मन से प्रार्थना:** सच्चे मन से प्रार्थना करना और भगवान शिव से अपनी इच्छा व्यक्त करना महत्वपूर्ण है।

//   <br/> 

// #### अन्य उपाय:

// <br/>

//   - **सोमवार व्रत:** सोमवार का दिन भगवान शिव को समर्पित होता है। इस दिन व्रत रखने और भगवान शिव की पूजा करने से विशेष फल प्राप्त होता है।

//   - **शिवरात्रि व्रत:** महाशिवरात्रि भगवान शिव का सबसे महत्वपूर्ण त्यौहार है। इस दिन व्रत रखने और भगवान शिव की पूजा करने से विशेष आशीर्वाद प्राप्त होता है।

//   - **दान:** गरीबों और जरूरतमंदों को दान करना भगवान शिव को प्रसन्न करने का एक उत्तम तरीका है।

//   - **पशु-पक्षियों की सेवा:** पशु-पक्षियों की सेवा करना भी भगवान शिव को प्रसन्न करने का एक अच्छा तरीका है।

//   <br/> 

// #### कुछ महत्वपूर्ण बातें:
// <br/> 

//   - **शुद्ध मन:** भगवान शिव को प्रसन्न करने के लिए सबसे महत्वपूर्ण बात है शुद्ध मन और भक्तिभाव रखना।

//   - **नियमितता:** पूजा-पाठ और अन्य उपायों को नियमित रूप से करना महत्वपूर्ण है।

//   - **धैर्य:** भगवान शिव को प्रसन्न करने में समय लग सकता है, इसलिए धैर्य रखना महत्वपूर्ण है।

// यह ध्यान रखना महत्वपूर्ण है कि भगवान शिव को प्रसन्न करने के लिए किसी विशेष विधि की आवश्यकता नहीं है। सच्चे मन से भक्ति और समर्पण ही सबसे महत्वपूर्ण है।
//       `,
//       postDate: "12 February 2024",
//       postImageUrl: "/assets/images/post/post-296.jpeg",
//       postUrl: "Post/296",
//       timeToRead: "4 Mins to Read",
//       postLanguage:Languages.Hindi
//     },
//   ];

  // getRecentPossts(): Observable<Post[]> {
  //   return of(this.recentPost);
  // }

  // getPostDetails(postId: number): Observable<Post | undefined> | undefined {
  //   return of(this.recentPost.find(f => f.postId === postId));
  // }


  constructor(private http: HttpClient) {}
  
  //Posts
  getAllPosts(): Observable<VPostDetails[]> {
    return this.http.get<VPostDetails[]>(`https://omnamahshivay-api.onrender.com/getAllPosts`);
  }

  getPostDetails(postId: number): Observable<VPostDetails> {
    return this.http.get<VPostDetails>(`https://omnamahshivay-api.onrender.com/getPostDetails/${postId}`);
  }


 
}
