import { Injectable } from '@angular/core';
import { Observable, of } from 'rxjs';
import { Post } from '../../model/post.model';

@Injectable({
  providedIn: 'root'
})
export class PostService {

  recentPost: Post[] = [
    {
      postId: 293,
      postTitle: "भगवान शिव (Lord Shiva) - महादेव के दिव्य रूपण",
      postContent: `
     
      भगवान शिव हिन्दू धर्म के महत्वपूर्ण देवता में से एक हैं। वे त्रिमूर्ति के भगवान हैं, जिनमें ब्रह्मा जी का सृजनकारण, विष्णु जी का पालन और महेश्वर (शिव) जी का संहार और सृष्टि का संचालन होता है।

      <strong>रूपण और आभूषण:</strong> भगवान शिव का रूप विशाल और भयानक होता है। उनकी तिलक बिना जाते ही त्रिपुण्ड्र (तीन लाइनों की चिन्ह) होती है जो उनकी विशेष पहचान है। उनके शिरे पर सर्पों की माला और चंद्रमा की रटी बनी रहती है। उनके जटामुकुट से वीरेश्वर (वीरभद्र) जैसे सहायक भी उत्पन्न होते हैं।
      
      <strong>नामकरण:</strong> भगवान शिव के कई नाम हैं जैसे भोलेनाथ, महादेव, नीलकंठ, रुद्र, ईश्वर, शंकर, नटराज आदि। ये सभी नाम उनके विभिन्न रूपों और आवतारों को दर्शाते हैं।
      
      <strong>ध्यान और साधना:</strong> भगवान शिव की ध्यान और साधना से मन, शरीर और आत्मा की शुद्धि होती है। उनकी पूजा के लिए बिल्व पत्र, धातूरा, जल, धूप, दीप, अर्क, बिना जाते हुए दूध, गंध आदि का उपयोग होता है। भोलेनाथ की भक्ति से व्यक्ति को आत्मा की उन्नति और शांति प्राप्त होती है।
      
      <strong>नटराज:</strong> भगवान शिव का एक प्रमुख रूप नटराज है, जिसमें वे नृत्य करते हुए दिखाए जाते हैं। नटराज के द्वारा उन्होंने सृष्टि की नीति-नियम का प्रतीक दिखाया है और इसे नष्ट होने और पुनर्निर्माण की स्थिति को दर्शाया है।
      
      भगवान शिव ध्यान, साधना, और संयम के प्रतीक हैं जो व्यक्ति को आध्यात्मिक उन्नति की दिशा में मार्गदर्शन करते हैं। उनकी महिमा और शक्ति का वर्णन वेदों और पुराणों में होता है और उन्हें सभी दिशाओं में पूजा जाता है।`,
      postDate: "09 February 2024",
      postImageUrl: "/assets/images/shiva/shiva-1.jpg",
      postUrl: "Post/293",
      timeToRead: "5 Mins to Read"
    },
    {
      postId: 294,
      postTitle: "दिव्य रहस्यों का पर्दाफाश: भगवान शिव के त्रिशूल, डमरू और रुद्राक्ष का प्रतीक",
      postContent: `
      **भगवान शिव के प्रतीकों का दिव्य रहस्य: त्रिशूल, डमरू और रुद्राक्ष**

      भगवान शिव, हिंदू धर्म के प्रमुख देवताओं में से एक हैं, जिन्हें अक्सर उनके शक्तिशाली प्रतीकों के साथ प्रतिष्ठित किया जाता है। इन प्रतीकों के पीछे छिपे गहरे अर्थों को समझने से हम शिव की महानता और उनकी अद्वितीयता का अनुभव करते हैं। चलिए, हम इन प्रतीकों के रहस्य को समझें:
      
      **1. त्रिशूल:**  
      त्रिशूल, जिसमें तीन शूल होते हैं, शिव की विनाशक और परिवर्तनकारी शक्तियों का प्रतीक है। यह अहंकार, कामना, और माया के तीन गुणों को काटते हैं और हमें मोक्ष की ओर ले जाते हैं। त्रिशूल जिन्हें इच्छा, ज्ञान, और क्रिया की शक्तियों का प्रतिनिधित्व करता है। यह त्रिशूल शिव की शक्ति का प्रतीक है जो संसार के अध्यात्मिक और भौतिक उत्थान के लिए कार्यरत है।
      
      **2. डमरू:**  
      डमरू ध्वनि के प्रतीक है, जो सृष्टि की उत्पत्ति को दर्शाती है। इसकी ध्वनि ब्रह्मांड की उत्पत्ति और संहार की गति को प्रतिनिधित्व करती है। शिव के हाथ में डमरू सृजन और संहार की शक्ति का प्रतीक है, जो हमें आत्मज्ञान की ओर ले जाता है। डमरू की ध्वनि के द्वारा ही सृष्टि का नियमित चक्र चलता है, जिससे हमें सम्पूर्णता की अनुभूति होती है।
      
      **3. रुद्राक्ष:**  
      रुद्राक्ष, जो शिव के तीसरे नेत्र से उत्पन्न हुए हैं, आध्यात्मिक शक्ति का प्रतीक हैं। ये मोक्ष, शांति, और ज्ञान को प्रदान करते हैं और नकारात्मक ऊर्जा से बचाने और सकारात्मक ऊर्जा को आकर्षित करने में मदद करते हैं। रुद्राक्ष के माध्यम से हम शिव की कृपा को अनुभव करते हैं और उनके ध्यान में स्थित होते हैं।
      
      **प्रतीकों का सम्मिलित अर्थ:**  
      इन प्रतीकों को एक साथ देखकर, वे शिव की त्रिमूर्ति (ब्रह्मा, विष्णु, और महेश) का प्रतिनिधित्व करते हैं। त्रिशूल सृष्टि का विनाश, डमरू सृष्टि की उत्पत्ति, और रुद्राक्ष सृष्टि की पालन का प्रतीक है। ये हमें जीवन के चक्र को समझाते हैं और आध्यात्मिक विकास की ओर दिशा प्रदान करते हैं।
      
      **अतिरिक्त विचार:**  
      ये प्रतीक और उनके अर्थ कई कथाओं और विविध व्याख्याओं से भरे हैं, जो हमारे ज्ञान और आध्यात्मिक विकास में मदद करते हैं। इन प्रतीकों को देखना हमें शिव की कृपा और उनकी शक्ति का स्मरण कराता है, और सही रास्ते पर चलने की प्रेरणा प्रदान करता है।
      
      **मुझे आशा है कि यह पोस्ट आपको भगवान शिव के प्रतीकों के गहरे अर्थों को समझने में मदद करेगी।**
      `,
      postDate: "10 February 2024",
      postImageUrl: "/assets/images/post/post-294.jpg",
      postUrl: "Post/294",
      timeToRead: "6 Mins to Read"
    },
  ];

  getRecentPossts(): Observable<Post[]> {
    return of(this.recentPost);
  }

  getPostDetails(postId: number): Observable<Post | undefined> | undefined {
    return of(this.recentPost.find(f => f.postId === postId));
  }

  constructor() { }
}
