import { Injectable } from '@angular/core';
import { Observable, of } from 'rxjs';
import { Post } from '../../model/post.model';

@Injectable({
  providedIn: 'root'
})
export class PostService {

  recentPost: Post[] = [
    {
      postId: 123,
      postTitle: "भगवान शिव (Lord Shiva) - महादेव के दिव्य रूपण",
      postContent: `
     
      भगवान शिव हिन्दू धर्म के महत्वपूर्ण देवता में से एक हैं। वे त्रिमूर्ति के भगवान हैं, जिनमें ब्रह्मा जी का सृजनकारण, विष्णु जी का पालन और महेश्वर (शिव) जी का संहार और सृष्टि का संचालन होता है।

      <strong>रूपण और आभूषण:</strong> भगवान शिव का रूप विशाल और भयानक होता है। उनकी तिलक बिना जाते ही त्रिपुण्ड्र (तीन लाइनों की चिन्ह) होती है जो उनकी विशेष पहचान है। उनके शिरे पर सर्पों की माला और चंद्रमा की रटी बनी रहती है। उनके जटामुकुट से वीरेश्वर (वीरभद्र) जैसे सहायक भी उत्पन्न होते हैं।
      
      <strong>नामकरण:</strong> भगवान शिव के कई नाम हैं जैसे भोलेनाथ, महादेव, नीलकंठ, रुद्र, ईश्वर, शंकर, नटराज आदि। ये सभी नाम उनके विभिन्न रूपों और आवतारों को दर्शाते हैं।
      
      <strong>ध्यान और साधना:</strong> भगवान शिव की ध्यान और साधना से मन, शरीर और आत्मा की शुद्धि होती है। उनकी पूजा के लिए बिल्व पत्र, धातूरा, जल, धूप, दीप, अर्क, बिना जाते हुए दूध, गंध आदि का उपयोग होता है। भोलेनाथ की भक्ति से व्यक्ति को आत्मा की उन्नति और शांति प्राप्त होती है।
      
      <strong>नटराज:</strong> भगवान शिव का एक प्रमुख रूप नटराज है, जिसमें वे नृत्य करते हुए दिखाए जाते हैं। नटराज के द्वारा उन्होंने सृष्टि की नीति-नियम का प्रतीक दिखाया है और इसे नष्ट होने और पुनर्निर्माण की स्थिति को दर्शाया है।
      
      भगवान शिव ध्यान, साधना, और संयम के प्रतीक हैं जो व्यक्ति को आध्यात्मिक उन्नति की दिशा में मार्गदर्शन करते हैं। उनकी महिमा और शक्ति का वर्णन वेदों और पुराणों में होता है और उन्हें सभी दिशाओं में पूजा जाता है।`,
      postDate: "09 February 2024",
      postImageUrl: "/assets/images/shiva/shiva-1.jpg",
      postUrl: "Post/123",
      timeToRead: "12 Mins to Read"
    },
  ];

  getRecentPossts(): Observable<Post[]> {
    return of(this.recentPost);
  }

  getPostDetails(postId: number): Observable<Post|undefined> | undefined { 
    return of(this.recentPost.find(f => f.postId === postId));
  }

  constructor() { }
}
